app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params)
    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 101], ["created_at", "2020-01-31 22:26:13.410731"], ["updated_at", "2020-01-31 22:26:13.410731"]]